; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/transport/domain.pddl
; updates:
;  - removed :action-costs and :functions
;  - capacity type now is size
;  - capacity-number predicate now is capacity
;  - remove the road predicate to allow fully connected graph
(define (domain transport)
  (:requirements :typing)
  (:types
        size location locatable - object
        vehicle package - locatable
  )

  (:predicates
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - size)
     (capacity-predecessor ?s1 ?s2 - size)
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (not (at ?v ?l2))
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
      )
  )

)

; problem
;; vehicles=4, packages=6, locations=10, density=1.0, fully_connected=True, max_capacity=2, out_folder=./fully/training, instance_id=13, seed=54

(define (problem transport-13)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 - vehicle
    p1 p2 p3 p4 p5 p6 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c2)
    (capacity v3 c2)
    (capacity v4 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l8)
    (at p2 l7)
    (at p3 l4)
    (at p4 l8)
    (at p5 l6)
    (at p6 l10)
    (at v1 l7)
    (at v2 l4)
    (at v3 l4)
    (at v4 l1)
    )
 (:goal  (and 
    (at p1 l9)
    (at p2 l8)
    (at p3 l10)
    (at p4 l2)
    (at p5 l9)
    (at p6 l6))))

; plan
1. (pick-up v3 l4 p3 c1 c2)
   deleted: (at p3 l4) (capacity v3 c2)
   added: (in p3 v3) (capacity v3 c1)
   goals met: 0 of 6
2. (drive v3 l4 l10)
   deleted: (at v3 l4)
   added: (at v3 l10)
   goals met: 0 of 6
3. (drop v3 l10 p3 c1 c2)
   deleted: (in p3 v3) (capacity v3 c1)
   added: (at p3 l10) (capacity v3 c2)
   goals met: 1 of 6
4. (pick-up v3 l10 p6 c1 c2)
   deleted: (at p6 l10) (capacity v3 c2)
   added: (in p6 v3) (capacity v3 c1)
   goals met: 1 of 6
5. (drive v3 l10 l6)
   deleted: (at v3 l10)
   added: (at v3 l6)
   goals met: 1 of 6
6. (pick-up v3 l6 p5 c0 c1)
   deleted: (at p5 l6) (capacity v3 c1)
   added: (in p5 v3) (capacity v3 c0)
   goals met: 1 of 6
7. (drop v3 l6 p6 c0 c1)
   deleted: (in p6 v3) (capacity v3 c0)
   added: (at p6 l6) (capacity v3 c1)
   goals met: 2 of 6
8. (drive v3 l6 l9)
   deleted: (at v3 l6)
   added: (at v3 l9)
   goals met: 2 of 6
9. (drop v3 l9 p5 c1 c2)
   deleted: (in p5 v3) (capacity v3 c1)
   added: (at p5 l9) (capacity v3 c2)
   goals met: 3 of 6
10. (drive v1 l7 l8)
   deleted: (at v1 l7)
   added: (at v1 l8)
   goals met: 3 of 6
11. (pick-up v1 l8 p1 c0 c1)
   deleted: (at p1 l8) (capacity v1 c1)
   added: (in p1 v1) (capacity v1 c0)
   goals met: 3 of 6
12. (drive v1 l8 l2)
   deleted: (at v1 l8)
   added: (at v1 l2)
   goals met: 3 of 6
13. (drive v3 l9 l8)
   deleted: (at v3 l9)
   added: (at v3 l8)
   goals met: 3 of 6
14. (pick-up v3 l8 p4 c1 c2)
   deleted: (at p4 l8) (capacity v3 c2)
   added: (in p4 v3) (capacity v3 c1)
   goals met: 3 of 6
15. (drive v1 l2 l9)
   deleted: (at v1 l2)
   added: (at v1 l9)
   goals met: 3 of 6
16. (drop v1 l9 p1 c0 c1)
   deleted: (in p1 v1) (capacity v1 c0)
   added: (at p1 l9) (capacity v1 c1)
   goals met: 4 of 6
17. (drive v3 l8 l2)
   deleted: (at v3 l8)
   added: (at v3 l2)
   goals met: 4 of 6
18. (drop v3 l2 p4 c1 c2)
   deleted: (in p4 v3) (capacity v3 c1)
   added: (at p4 l2) (capacity v3 c2)
   goals met: 5 of 6
19. (drive v1 l9 l7)
   deleted: (at v1 l9)
   added: (at v1 l7)
   goals met: 5 of 6
20. (pick-up v1 l7 p2 c0 c1)
   deleted: (at p2 l7) (capacity v1 c1)
   added: (in p2 v1) (capacity v1 c0)
   goals met: 5 of 6
21. (drive v1 l7 l8)
   deleted: (at v1 l7)
   added: (at v1 l8)
   goals met: 5 of 6
22. (drop v1 l8 p2 c0 c1)
   deleted: (in p2 v1) (capacity v1 c0)
   added: (at p2 l8) (capacity v1 c1)
   goals met: 6 of 6
